Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://127.0.0.1:5000"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Baseline Load Test (100 VUs / 1 min)"
scenarios:
  - name: "API Synthesis Prediction Flow"
    flow:
      - post:
          url: "/api/predict"
          json:
            base_material: "Zinc"
            target_material: "Iron"
            target_phase: "synthesis"
